; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 102)
	(= (data Phenomenon4 thermograph0) 144)
	(= (data Planet5 thermograph0) 70)
	(= (data Phenomenon6 thermograph0) 58)
	(= (data Star7 thermograph0) 266)
	(= (data Phenomenon4 thermograph2) 7)
	(= (data Planet5 thermograph2) 46)
	(= (data Phenomenon6 thermograph2) 20)
	(= (data Star7 thermograph2) 154)
	(= (data Phenomenon4 image1) 292)
	(= (data Planet5 image1) 167)
	(= (data Phenomenon6 image1) 244)
	(= (data Star7 image1) 126)
	(= (slew_time Star1 Star0) 18.63)
	(= (slew_time Star0 Star1) 18.63)
	(= (slew_time GroundStation3 Star0) 86.41)
	(= (slew_time Star0 GroundStation3) 86.41)
	(= (slew_time GroundStation3 Star1) 57.02)
	(= (slew_time Star1 GroundStation3) 57.02)
	(= (slew_time GroundStation3 Star2) 39.16)
	(= (slew_time Star2 GroundStation3) 39.16)
	(= (slew_time Star2 Star0) 29.97)
	(= (slew_time Star0 Star2) 29.97)
	(= (slew_time Star2 Star1) 18.06)
	(= (slew_time Star1 Star2) 18.06)
	(= (slew_time Phenomenon4 Star0) 39.86)
	(= (slew_time Star0 Phenomenon4) 39.86)
	(= (slew_time Phenomenon4 Star1) 44.07)
	(= (slew_time Star1 Phenomenon4) 44.07)
	(= (slew_time Phenomenon4 Star2) 10.77)
	(= (slew_time Star2 Phenomenon4) 10.77)
	(= (slew_time Phenomenon4 GroundStation3) 17.47)
	(= (slew_time GroundStation3 Phenomenon4) 17.47)
	(= (slew_time Planet5 Star0) 20.21)
	(= (slew_time Star0 Planet5) 20.21)
	(= (slew_time Planet5 Star1) 21.81)
	(= (slew_time Star1 Planet5) 21.81)
	(= (slew_time Planet5 Star2) 16.5)
	(= (slew_time Star2 Planet5) 16.5)
	(= (slew_time Planet5 GroundStation3) 70.36)
	(= (slew_time GroundStation3 Planet5) 70.36)
	(= (slew_time Planet5 Phenomenon4) 18.2)
	(= (slew_time Phenomenon4 Planet5) 18.2)
	(= (slew_time Phenomenon6 Star0) 45.35)
	(= (slew_time Star0 Phenomenon6) 45.35)
	(= (slew_time Phenomenon6 Star1) 0.5073)
	(= (slew_time Star1 Phenomenon6) 0.5073)
	(= (slew_time Phenomenon6 Star2) 10.23)
	(= (slew_time Star2 Phenomenon6) 10.23)
	(= (slew_time Phenomenon6 GroundStation3) 47.96)
	(= (slew_time GroundStation3 Phenomenon6) 47.96)
	(= (slew_time Phenomenon6 Phenomenon4) 7.794)
	(= (slew_time Phenomenon4 Phenomenon6) 7.794)
	(= (slew_time Phenomenon6 Planet5) 12.21)
	(= (slew_time Planet5 Phenomenon6) 12.21)
	(= (slew_time Star7 Star0) 49.76)
	(= (slew_time Star0 Star7) 49.76)
	(= (slew_time Star7 Star1) 5.973)
	(= (slew_time Star1 Star7) 5.973)
	(= (slew_time Star7 Star2) 52.56)
	(= (slew_time Star2 Star7) 52.56)
	(= (slew_time Star7 GroundStation3) 29.63)
	(= (slew_time GroundStation3 Star7) 29.63)
	(= (slew_time Star7 Phenomenon4) 0.5198)
	(= (slew_time Phenomenon4 Star7) 0.5198)
	(= (slew_time Star7 Planet5) 12.83)
	(= (slew_time Planet5 Star7) 12.83)
	(= (slew_time Star7 Phenomenon6) 42.47)
	(= (slew_time Phenomenon6 Star7) 42.47)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 thermograph0)
	(have_image Planet5 image1)
	(have_image Phenomenon6 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 102 to 81.79, (fuel-used) from 0 to 20.21
   goals met: 0 of 3
4. (take_image satellite0 planet5 instrument1 image1)
   added: (have_image planet5 image1)
   changed: (data_capacity satellite0) from 1000 to 833, (data-stored) from 0 to 167
   goals met: 1 of 3
5. (turn_to satellite0 phenomenon4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 81.79 to 63.59, (fuel-used) from 20.21 to 38.41
   goals met: 1 of 3
6. (take_image satellite0 phenomenon4 instrument1 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   changed: (data_capacity satellite0) from 833 to 689, (data-stored) from 167 to 311
   goals met: 2 of 3
7. (turn_to satellite0 phenomenon6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 63.59 to 55.796, (fuel-used) from 38.41 to 46.204
   goals met: 2 of 3
8. (take_image satellite0 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   changed: (data_capacity satellite0) from 689 to 445, (data-stored) from 311 to 555
   goals met: 3 of 3
